openocd-org/openocd/contrib/loaders/flash/cc26xx/hw_regs.h
/* SPDX-License-Identifier: BSD-3-Clause */

/******************************************************************************
*
* Copyright (C) 2017-2018 Texas Instruments Incorporated - http://www.ti.com/
*
******************************************************************************/

#ifndef OPENOCD_LOADERS_FLASH_CC26XX_HW_REGS_H
#define OPENOCD_LOADERS_FLASH_CC26XX_HW_REGS_H

/******************************************************************************
*
* Macros for direct hardware access.
*
* If using these macros the programmer should be aware of any limitations to
* the address accessed i.e. if it supports word and/or byte access.
*
******************************************************************************/
/* Word (32 bit) access to address x */
/* Read example  : my32BitVar = HWREG(base_addr + offset) ; */
/* Write example : HWREG(base_addr + offset) = my32BitVar ; */
#define HWREG(x) (*((volatile unsigned long *)(x)))

/* Half word (16 bit) access to address x */
/* Read example  : my16BitVar = HWREGH(base_addr + offset) ; */
/* Write example : HWREGH(base_addr + offset) = my16BitVar ; */
#define HWREGH(x) (*((volatile unsigned short *)(x)))

/* Byte (8 bit) access to address x */
/* Read example  : my8BitVar = HWREGB(base_addr + offset) ; */
/* Write example : HWREGB(base_addr + offset) = my8BitVar ; */
#define HWREGB(x) (*((volatile unsigned char *)(x)))

/******************************************************************************
*
* Macro for access to bit-band supported addresses via the bit-band region.
*
* Macro calculates the corresponding address to access in the bit-band region
* based on the actual address of the memory/register and the bit number.
*
* Do NOT use this macro to access the bit-band region directly!
*
******************************************************************************/
/* Bit-band access to address x bit number b using word access (32 bit) */
#define HWREGBITW(x, b) \
	HWREG(((unsigned long)(x) & 0xF0000000) | 0x02000000 | \
		(((unsigned long)(x) & 0x000FFFFF) << 5) | ((b) << 2))

/******************************************************************************
*
* Memory mapped components base address definitions
*
******************************************************************************/
#define FLASH_BASE                                                  0x40030000
#define FLASH_CFG_BASE                                              0x50000000
#define AON_PMCTL_BASE                                              0x40090000

/******************************************************************************
*
* This section defines the register offsets of FLASH component
*
******************************************************************************/

/* FMC and Efuse Status */
#define FLASH_O_STAT                                                0x0000001C

/* Configuration */
#define FLASH_O_CFG                                                 0x00000024

/* Flash Size Configuration */
#define FLASH_O_FLASH_SIZE                                          0x0000002C

/* Firmware Lock */
#define FLASH_O_FWLOCK                                              0x0000003C

/* Firmware Flags */
#define FLASH_O_FWFLAG                                              0x00000040

/* FMC Read Control */
#define FLASH_O_FRDCTL                                              0x00002000

/* FMC Bank Protection */
#define FLASH_O_FBPROT                                              0x00002030

/* FMC Bank Sector Enable */
#define FLASH_O_FBSE                                                0x00002034

/* FMC Module Access Control */
#define FLASH_O_FMAC                                                0x00002050

/* FMC Module Status */
#define FLASH_O_FMSTAT                                              0x00002054

/* FMC Flash Lock */
#define FLASH_O_FLOCK                                               0x00002064

/* FMC VREADCT Trim */
#define FLASH_O_FVREADCT                                            0x00002080

/* FMC VHVCT1 Trim */
#define FLASH_O_FVHVCT1                                             0x00002084

/* FMC VHVCT2 Trim */
#define FLASH_O_FVHVCT2                                             0x00002088

/* FMC VNVCT Trim */
#define FLASH_O_FVNVCT                                              0x00002090

/* FMC VSL_P Trim */
#define FLASH_O_FVSLP                                               0x00002094

/* FMC VWLCT Trim */
#define FLASH_O_FVWLCT                                              0x00002098

/* FMC Sequential Pump Information */
#define FLASH_O_FSEQPMP                                             0x000020A8

#define FLASH_O_FADDR                                               0x00002110

#define FLASH_O_FWPWRITE0                                           0x00002120

/* FMC FSM Command */
#define FLASH_O_FSM_CMD                                             0x0000220C

/* FMC FSM Program/Erase Operation Setup */
#define FLASH_O_FSM_PE_OSU                                          0x00002210

/* FMC FSM Voltage Status Setup */
#define FLASH_O_FSM_VSTAT                                           0x00002214

/* FMC FSM Program/Erase Verify Setup */
#define FLASH_O_FSM_PE_VSU                                          0x00002218

/* FMC FSM Compare Verify Setup */
#define FLASH_O_FSM_CMP_VSU                                         0x0000221C

/* FMC FSM EXECUTEZ to Valid Data */
#define FLASH_O_FSM_EX_VAL                                          0x00002220

/* FMC FSM Read Mode Hold */
#define FLASH_O_FSM_RD_H                                            0x00002224

/* FMC FSM Program Hold */
#define FLASH_O_FSM_P_OH                                            0x00002228

/* FMC FSM Erase Operation Hold */
#define FLASH_O_FSM_ERA_OH                                          0x0000222C

/* FMC FSM Program/Erase Verify Hold */
#define FLASH_O_FSM_PE_VH                                           0x00002234

/* FMC FSM Program Pulse Width */
#define FLASH_O_FSM_PRG_PW                                          0x00002240

/* FMC FSM Erase Pulse Width */
#define FLASH_O_FSM_ERA_PW                                          0x00002244

